Autodesk.Revit.DB.Structure.RebarConstraint.ReplaceReferenceTargets(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Boolean,System.Double)
Replaces the current set of references, the type of constraint and the offset value, with the newly provided ones.
Will throw exception if this is a constraint for Shape Driven Rebar.
handle:
The RebarConstrainedHandle that has this constraint.
targetReferences:
The references to which the rebar handle will be constrained.
This collection must contain one or more references to faces of elements that can host rebar.
isConstraintToCover:
If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue:
The distance from references to the rebar handle.
Throws Autodesk.Revit.Exceptions.ArgumentException:
handle is no longer valid.
-or-
targetReferences is empty.
-or-
targetReferences do not represent faces from structurals that can host rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Constrained rebar is a shape driven rebar element.
Since:
2018